In [2]:
import pandas as pd

In [4]:
data = {
    "NAME":["A","B","C"],
    "AGE":["25","28","32"]
        }

In [5]:
df=pd.DataFrame(data)
df

  NAME AGE
0    A  25
1    B  28
2    C  32

In [18]:
df = pd.read_csv(".\data.csv")
df

      NAME  AGE  SALARY
0   Hassan   32    1000
1      Ali   33    4000
2    Vahid   32    2500
3   Behnam   33    3400
4  Mahmoud   30    2400
5    Zahra   28    3300
6   Maryam   28    2800

In [19]:
df.head()

      NAME  AGE  SALARY
0   Hassan   32    1000
1      Ali   33    4000
2    Vahid   32    2500
3   Behnam   33    3400
4  Mahmoud   30    2400

In [30]:
df.iloc[4,2]

np.int64(2400)

In [20]:
df.describe()

             AGE       SALARY
count   7.000000     7.000000
mean   30.857143  2771.428571
std     2.193063   960.406660
min    28.000000  1000.000000
25%    29.000000  2450.000000
50%    32.000000  2800.000000
75%    32.500000  3350.000000
max    33.000000  4000.000000

In [23]:
df["NAME"]

0     Hassan
1        Ali
2      Vahid
3     Behnam
4    Mahmoud
5      Zahra
6     Maryam
Name: NAME, dtype: object

In [25]:
df["AGE"]

0    32
1    33
2    32
3    33
4    30
5    28
6    28
Name: AGE, dtype: int64

In [27]:
df["SALARY"]

0    1000
1    4000
2    2500
3    3400
4    2400
5    3300
6    2800
Name: SALARY, dtype: int64

In [28]:
df.iloc[2,:]

NAME      Vahid
AGE          32
SALARY     2500
Name: 2, dtype: object

In [29]:
df.iloc[2,1]

np.int64(32)

In [34]:
filtered_df=df[df["SALARY"]>2500]
filtered_df

     NAME  AGE  SALARY
1     Ali   33    4000
3  Behnam   33    3400
5   Zahra   28    3300
6  Maryam   28    2800

In [43]:
df_sorted = df.sort_values("SALARY",ascending=True)
df_sorted

      NAME  AGE  SALARY
0   Hassan   32    1000
4  Mahmoud   30    2400
2    Vahid   32    2500
6   Maryam   28    2800
5    Zahra   28    3300
3   Behnam   33    3400
1      Ali   33    4000

In [47]:
Subset = df.loc[2:4,["NAME","AGE"]]
Subset

      NAME  AGE
2    Vahid   32
3   Behnam   33
4  Mahmoud   30

In [51]:
df_grouped = df.groupby("AGE")
df_grouped

In [52]:
df_sorted

      NAME  AGE  SALARY
0   Hassan   32    1000
4  Mahmoud   30    2400
2    Vahid   32    2500
6   Maryam   28    2800
5    Zahra   28    3300
3   Behnam   33    3400
1      Ali   33    4000

In [53]:
df_grouped = df.groupby("AGE")
df_grouped

In [54]:
df

      NAME  AGE  SALARY
0   Hassan   32    1000
1      Ali   33    4000
2    Vahid   32    2500
3   Behnam   33    3400
4  Mahmoud   30    2400
5    Zahra   28    3300
6   Maryam   28    2800

In [56]:
df_grouped.count()

     NAME  SALARY
AGE
28      2       2
30      1       1
32      2       2
33      2       2

In [57]:
df["test"]=[1,2,3,4,5,6,7]
df

      NAME  AGE  SALARY  test
0   Hassan   32    1000     1
1      Ali   33    4000     2
2    Vahid   32    2500     3
3   Behnam   33    3400     4
4  Mahmoud   30    2400     5
5    Zahra   28    3300     6
6   Maryam   28    2800     7

In [58]:
df.drop("test", axis=1,inplace=True)

In [59]:
df

      NAME  AGE  SALARY
0   Hassan   32    1000
1      Ali   33    4000
2    Vahid   32    2500
3   Behnam   33    3400
4  Mahmoud   30    2400
5    Zahra   28    3300
6   Maryam   28    2800

In [60]:
len(df)

7

In [64]:
df.loc[len(df)]={
    "NAME":"TESST", "AGE":45
    }
df

      NAME  AGE  SALARY
0   Hassan   32  1000.0
1      Ali   33  4000.0
2    Vahid   32  2500.0
3   Behnam   33  3400.0
4  Mahmoud   30  2400.0
5    Zahra   28  3300.0
6   Maryam   28  2800.0
7    TESST   45     NaN
8    TESST   45     NaN

In [65]:
df.isna()

    NAME    AGE  SALARY
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False    True
8  False  False    True

In [67]:
df1=df.dropna()

In [68]:
df.fillna("0")

      NAME  AGE  SALARY
0   Hassan   32  1000.0
1      Ali   33  4000.0
2    Vahid   32  2500.0
3   Behnam   33  3400.0
4  Mahmoud   30  2400.0
5    Zahra   28  3300.0
6   Maryam   28  2800.0
7    TESST   45       0
8    TESST   45       0

In [70]:
df.to_csv("new_data.csv")